#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```

grafana_folder.folder1: Refreshing state... [id=0:32]
grafana_dashboard.test: Refreshing state... [id=0:test-dashboard-uid]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # grafana_dashboard.test will be destroyed
  # (because grafana_dashboard.test is not in configuration)
  - resource "grafana_dashboard" "test" {
      - config_json  = jsonencode(
            {
              - title = "Test Dashboard"
              - uid   = "test-dashboard-uid"
            }
        ) -> null
      - dashboard_id = 33 -> null
      - folder       = "adc8sfaj7aozkf" -> null
      - id           = "0:test-dashboard-uid" -> null
      - org_id       = "0" -> null
      - uid          = "test-dashboard-uid" -> null
      - url          = "https://grafana09ca.grafana.net/d/test-dashboard-uid/test-dashboard" -> null
      - version      = 2 -> null
    }

  # grafana_dashboard.test1 will be created
  + resource "grafana_dashboard" "test1" {
      + config_json  = jsonencode(
            {
              + title = "Test Dashboard 1"
              + uid   = "test-dashboard-1-uid"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = "adc8sfaj7aozkf"
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.test2 will be created
  + resource "grafana_dashboard" "test2" {
      + config_json  = jsonencode(
            {
              + title = "Test Dashboard 2"
              + uid   = "test-dashboard-2-uid"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = "adc8sfaj7aozkf"
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: test-13.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "test-13.tfplan"
```

</details>

*Pusher: @germanium-git, Action: `pull_request`, Workflow: `Terraform: Test on PR open`*